#### Exercise

In [1]:
pip install word2number

Requirement already satisfied: word2number in e:\anaconda\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates:

- 2 yr experience, 9 test score, 6 interview score

- 12 yr experience, 10 test score, 10 interview score

In [2]:
import numpy as np
import pandas as pd
from word2number import w2n
from sklearn import linear_model

In [3]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [5]:
import math
temp = df['test_score(out of 10)'].mean()
median_score = math.floor(temp)

In [6]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_score)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
df['experience'] = df.experience.fillna('zero')

In [8]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [9]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score(out of 10)', 'interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [10]:
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [11]:
reg.intercept_

14992.651446693133

In [12]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [13]:
reg.predict([[12,10,10]])

array([93747.79628651])